Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Instead, an interception proxy filters or redirects outgoing TCP port 80 packets (and occasionally other common port traffic).
zh_cn: 相反，拦截代理过滤或重定向传出的 TCP 端口 80 数据包(有时还有其他常见的端口流量)。

source: Instead, it MUST continue the handshake with a randomly generated premaster secret.
zh_cn: 相反，它必须继续握手用随机生成的预主密钥。

source: Instead, it delegates the issue of registered name syntax conformance to the operating system of each application performing URI resolution, and that operating system decides what it will allow for the purpose of host identification.
zh_cn: 相反，它将注册名称语法一致性的问题委托给执行 URI 解析的每个应用程序的操作系统，并且该操作系统决定它将允许用于主机识别的目的。

source: Instead, this specification uses ABNF rules that are named according to each registered field name, wherein the rule defines the valid grammar for that field's corresponding field values (i.e., after the field-value has been extracted from the header section by a generic field parser).
zh_cn: 相反，该规范使用根据每个注册的字段名称命名的 ABNF 规则，其中该规则定义该字段的相应字段值的有效语法（即，在通用字段解析器从首部部分提取字段值之后）。

source: Instead, we are limited to defining the syntax of communication, the intent of received communication, and the expected behavior of recipients.
zh_cn: 相反，我们仅限于定义通信语法，接收通信的意图以及接收者的预期行为。

source: Instead, we defined our own functional interfaces in 1.x and 2.x follows this tradition.
zh_cn: 相反，我们在 1.x 和 2.x 中定义了我们自己的函数接口遵循这一传统。

source: Interception proxies are commonly found on public network access points, as a means of enforcing account subscription prior to allowing use of non-local Internet services, and within corporate firewalls to enforce network usage policies.
zh_cn: 拦截代理通常位于公共网络接入点上，作为在允许使用非本地互联网服务之前强制执行帐户订阅的方法，以及在企业防火墙内实施网络使用策略。

source: Interfaces
zh_cn: 接口

source: Intermediaries
zh_cn: 中介

source: Intermediaries that process HTTP messages (i.e., all intermediaries other than those acting as tunnels) MUST send their own HTTP-version in forwarded messages.
zh_cn: 处理 HTTP 消息的中介(即除充当隧道之外的所有中介)必须在转发的消息中发送自己的 HTTP 版本。

source: Internal changes in 2.0.6 now consistently cancel or dispose a `Subscription`/`Disposable` before cancelling/disposing a task or worker (which causes the interrupt on the target thread).
zh_cn: 2.0.6 中的内部更改现在在取消/释放任务或工作程序(导致目标线程上的中断)之前始终取消或释放 `Subscription`/“Disposable”。

source: Internally, asynchronous operators have buffers to hold such elements until they can be processed.
zh_cn: 在内部，异步操作符具有缓冲区来保存这些元素，直到它们可以被处理。

source: Internet Media Type Registration
zh_cn: 互联网媒体类型注册

source: Internet media types are registered with a canonical form.
zh_cn: 互联网媒体类型以规范形式注册。

source: Internet-Drafts are draft documents valid for a maximum of six months and may be updated, replaced, or obsoleted by other documents at any time.
zh_cn: 互联网草案是有效期最长为六个月的草案文件，可能随时被其他文件更新，替换或废弃。

source: Internet-Drafts are working documents of the Internet Engineering Task Force (IETF).
zh_cn: Internet-Drafts 是互联网工程任务组(IETF)的工作文档。

source: Interoperability: Independent programmers should be able to develop applications utilizing TLS that can successfully exchange cryptographic parameters without knowledge of one another's code.
zh_cn: 互操作性：独立程序员应该能够利用 TLS 开发应用程序，这些应用程序可以在不了解彼此代码的情况下成功交换加密参数。

source: Introduction
zh_cn: 介绍

source: Introduction of Content-Encoding
zh_cn: 内容编码简介

source: Introduction of Transfer-Encoding
zh_cn: 传输编码的介绍

source: Invalid whitespace around field-names is now required to be rejected, because accepting it represents a security vulnerability.
zh_cn: 现在需要拒绝字段名称周围的无效空格，因为接受它代表了一个安全漏洞。

source: Invalidation After Updates or Deletions
zh_cn: 更新或删除后失效

source: Issues with the Keep-Alive and Proxy-Connection header fields in requests are pointed out, with use of the latter being discouraged altogether.
zh_cn: 指出了请求中的 Keep-Alive 和 Proxy-Connection 首部字段的问题，完全不鼓励使用后者。

source: It MAY resume a TLS session closed in this fashion.
zh_cn: 它可以以这种方式恢复关闭的 TLS 会话。

source: It MUST NOT appear in this extension.
zh_cn: 它不得出现在此扩展中。

source: It MUST NOT be sent by compliant implementations.
zh_cn: 它不能由兼容的实现发送。

source: It MUST NOT perform the requested method if it returns a final status code.
zh_cn: 如果它返回最终状态代码，则它不能执行所请求的方法。

source: It MUST be possible to combine the multiple header fields into one "field-name: field-value" pair, without changing the semantics of the message, by appending each subsequent field-value to the first, each separated by a comma.
zh_cn: 必须可以将多个首部字段组合成一个“字段名: 字段值”对，而不改变消息的语义，方法是将每个后续字段值附加到第一个字段值，每个字段值用逗号分隔。

source: It MUST immediately follow the client certificate message, if it is sent.
zh_cn: 它必须紧跟客户端证书消息(如果已发送)。

source: It MUST set the ServerHello.legacy_version field to 0x0303 (TLS 1.2).
zh_cn: 它必须将 ServerHello.legacy_version 字段设置为 0x0303(TLS 1.2)。

source: It allows different types of resource identifiers to be used in the same context, even when the mechanisms used to access those resources may differ.
zh_cn: 它允许在同一上下文中使用不同类型的资源标识符，即使用于访问这些资源的机制可能不同。

source: It allows introduction of new types of resource identifiers without interfering with the way that existing identifiers are used.
zh_cn: 它允许引入新类型的资源标识符，而不会干扰现有标识符的使用方式。

source: It allows the identifiers to be reused in many different contexts, thus permitting new applications or protocols to leverage a pre-existing, large, and widely used set of resource identifiers.
zh_cn: 它允许标识符在许多不同的上下文中重用，从而允许新的应用程序或协议利用预先存在的，大量且广泛使用的资源标识符集。

source: It allows uniform semantic interpretation of common syntactic conventions across different types of resource identifiers.
zh_cn: 它允许跨不同类型的资源标识符对通用语法约定进行统一的语义解释。

source: It also changes how Online Certificate Status Protocol (OCSP) messages are carried and therefore updates [RFC6066] and obsoletes [RFC6961] as described in Section 4.4.2.1.
zh_cn: 它还更改了在线证书状态协议(OCSP)消息的携带方式，因此会更新 [RFC6066] 并废弃 [RFC6961]，如第 4.4.2.1 节所述。

source: It also defines cryptographic attributes such as the mac_length.
zh_cn: 它还定义了加密属性，例如 mac_length。

source: It also obsoletes the TLS ticket mechanism defined in [RFC5077] and replaces it with the mechanism defined in Section 2.2.
zh_cn: 它还废弃了 [RFC5077] 中定义的 TLS 票证机制，并将其替换为第 2.2 节中定义的机制。

source: It avoids a situation where compliance with the protocol would have necessitated a possibly infinite buffer on the proxy.
zh_cn: 它避免了这样一种情况，即遵从协议将需要代理上可能有无限的缓冲区。

source: It builds on the discipline of reference provided by the Uniform Resource Identifier (URI) [3], as a location (URL) [4] or name (URN) [20], for indicating the resource to which a method is to be applied.
zh_cn: 它建立在统一资源标识符(URI)[3] 提供的引用规则的基础上，作为位置(URL)[4] 或名称(URN)[20]，用于指示要应用方法的资源。

source: It can change at any time.
zh_cn: 它可以随时改变。

source: It can never be empty.
zh_cn: 它永远不会是空的。

source: It consists of both a grammar and a description of basic functionality for URI.
zh_cn: 它包含语法和 URI 基本功能的描述。

source: It depends on the Observable.
zh_cn: 这取决于 Observable。

source: It does not provide downgrade protection when static RSA is used.
zh_cn: 使用静态 RSA 时，它不提供降级保护。

source: It does not specify an Internet standard of any kind.
zh_cn: 它没有指定任何类型的互联网标准。

source: It enables uniform identification of resources via a separately defined extensible set of naming schemes (Section 3.1).
zh_cn: 它可以通过单独定义的可扩展命名方案集来统一识别资源(第 3.1 节)。

source: It excludes portions of RFC 1738 that defined the specific syntax of individual URI schemes; those portions will be updated as separate documents.
zh_cn: 它排除了 RFC 1738 中定义了各个 URI 方案的特定语法的部分；这些部分将作为单独的文件更新。

source: It excludes those portions of RFC 1738 that defined the specific syntax of individual URL schemes; those portions will be updated as separate documents, as will the process for registration of new URI schemes.
zh_cn: 它排除了 RFC 1738 中定义了各个 URL 方案的特定语法的那些部分；这些部分将作为单独的文档更新，新 URI 方案的注册过程也将更新。

source: It extends the observer pattern to support sequences of data and/or events and adds operators that allow you to compose sequences together declaratively while abstracting away concerns about things like low-level threading, synchronization, thread-safety, concurrent data structures, and non-blocking I/O.
zh_cn: 它扩展了 观察者模式 以支持数据和/或事件序列，并添加操作符，允许您以声明方式组合序列，而无需关注底层的线程，同步，线程安全，并发数据结构和非阻塞 I/O 等问题。

source: It extends the [observer pattern](http://en.wikipedia.org/wiki/Observer_pattern) to support sequences of data/events and adds operators that allow you to compose sequences together declaratively while abstracting away concerns about things like low-level threading, synchronization, thread-safety and concurrent data structures.
zh_cn: 它扩展了 [观察者模式](http://en.wikipedia.org/wiki/Observer_pattern) 以支持数据/事件序列，并添加运算符，允许您以声明方式组合序列，同时抽象出对低级别线程，同步，线程安全和并发数据结构等的关注。

source: It frees you from tangled webs of callbacks, and thereby makes your code more readable and less prone to bugs.
zh_cn: 它使您摆脱了纠结的回调网络，从而使您的代码更具可读性，且不易出错。

source: It has received public review and has been approved for publication by the Internet Engineering Steering Group (IESG).
zh_cn: 它已经过公众审查，并已获得互联网工程指导小组(IESG)的批准发布。

source: It has the usual modes, similar to `onBackpressureXXX` in addition to signalling a `MissingBackpressureException` or simply ignoring such overflow inside it altogether.
zh_cn: 它具有通常的模式，类似于 `onBackpressureXXX`，除了发出 `MissingBackpressureException` 信号或完全忽略它内部的溢出。

source: It is difficult to use Futures to optimally compose conditional asynchronous execution flows (or impossible, since latencies of each request vary at runtime).
zh_cn: 使用 Futures 难以很好地组合带条件的异步执行流程(或者可以说不可能，因为每个请求的延迟在运行时变化)。

source: It is RECOMMENDED that all HTTP senders and recipients support, at a minimum, request-line lengths of 8000 octets.
zh_cn: 建议所有 HTTP 发送者和接收者至少支持 8000 个八位字节的请求行长度。

source: It is a fatal error if a Finished message is not preceded by a ChangeCipherSpec message at the appropriate point in the handshake.
zh_cn: 如果在握手的适当位置，Finished 消息前面没有 ChangeCipherSpec 消息，则这是一个致命错误。

source: It is a generic, stateless, protocol which can be used for many tasks beyond its use for hypertext, such as name servers and distributed object management systems, through extension of its request methods, error codes and headers [47].
zh_cn: 它是一种通用的、无状态的协议，可以通过扩展其请求方法、错误代码和首部，用于超文本以外的许多任务，如名称服务器和分布式对象管理系统 [47]。

source: It is automatically applied by `RxJavaPlugins.onError` with intact stacktrace that may help find which exact operator rerouted the original error.
zh_cn: 它由 `RxJavaPlugins.onError` 自动应用，带有完整的堆栈跟踪，可以帮助找到哪个确切的运算符重新路由了原始错误。

source: It is beyond the scope of this specification to describe how connections are established via various transport- or session-layer protocols.
zh_cn: 描述如何通过各种传输或会话层协议建立连接超出了本规范的范围。

source: It is designed to hide the details of how a service is implemented by presenting a uniform interface to clients that is independent of the types of resources provided.
zh_cn: 它旨在通过向客户端提供独立于所提供资源类型的统一接口来隐藏服务实现方式的详细信息。

source: It is especially important that proxies correctly implement the properties of the Connection header field as specified in section 14.10.
zh_cn: 代理正确实现第 14.10 节中指定的 Connection 首部字段的属性尤为重要。

source: It is essential for providing authentication of the handshake and of the computed keys.
zh_cn: 它对于提供握手和计算密钥的身份验证是至关重要的。

source: It is essential that a change cipher spec message be received between the other handshake messages and the Finished message.
zh_cn: 至关重要的是，其他的握手消息和 Finished 消息之间被接收的更改加密规范消息。

source: It is essential to remember that the actual sequence number space is finite, though very large.
zh_cn: 必须记住，实际的序列号空间是有限的，尽管非常大。

source: It is expected that TLS implementations will rely on their PKI libraries to perform certificate selection using certificate extension OIDs.
zh_cn: 预计 TLS 实现将依赖其 PKI 库来使用证书扩展 OID 执行证书选择。

source: It is expected that the folding LWS will be replaced with a single SP before interpretation of the TEXT value.
zh_cn: 在解释 TEXT 值之前，预期折叠 LWS 将被单个 SP 替换。

source: It is generally assumed that implementations advertising only HTTP/1.0 support will not understand how to process a transfer-encoded payload.
zh_cn: 一般认为，只发布 HTTP/1.0 支持的实现将不了解如何处理传输编码的有效载荷。

source: It is illegal to make a state that has not been initialized with security parameters a current state.
zh_cn: 将尚未使用安全参数初始化的状态设置为当前状态是非法的。

source: It is implemented as a single JAR that is focused on just the Observable abstraction and related higher-order functions.
zh_cn: 它作为单个 JAR 实现，仅关注 Observable 抽象和相关的高阶函数。

source: It is inappropriate to use Internet-Drafts as reference material or to cite them other than as "work in progress."
zh_cn: 使用互联网草稿作为参考资料或引用它们而不是“正在进行的工作”是不恰当的。

source: It is likely the `compute(int)` method takes some time but the overhead of the `Flowable` operator chain may also add to the time it takes to process items.
zh_cn: `compute(int)` 方法可能需要一些时间，但 `Flowable` 操作链的开销也可能增加处理项目所需的时间。

source: It is not advised intermediate libraries change the error handler outside their own testing environment.
zh_cn: 不建议中间库在自己的测试环境之外更改错误处理程序。

source: It is not intended to be exhaustive, and there are many minor differences.
zh_cn: 它并非详尽无遗，并且存在许多细微差别。

source: It is not legal to send the ServerKeyExchange message for the following key exchange methods:
zh_cn: 为以下密钥交换方法发送 ServerKeyExchange 消息是不合法的：

source: It is not possible for the server to accept only a subset of the early data messages.
zh_cn: 服务器不可能只接受早期数据消息的子集。

source: It is not required for the initiator of the close to wait for the responding close_notify alert before closing the read side of the connection.
zh_cn: 在关闭连接的读取端之前，close 的发起者不需要等待响应的 close_notify 警报。

source: It is often the case also that later sequences would require values from earlier mappings.
zh_cn: 通常情况也是后来的序列需要来自早期映射的值。

source: It is recommended that new custom consumer implementations extend `FlowableSubscriber` instead of just `Subscriber`.
zh_cn: 建议新的自定义消费者实现继承 `FlowableSubscriber` 而不仅仅是 `Subscriber`。

source: It is sometimes called “functional reactive programming” but this is a misnomer.
zh_cn: 它有时被称为“函数响应式编程”，但这是用词不当。

source: It is tempting to think of resource identifiers as remote file system pathnames and of representations as being a copy of the contents of such files.
zh_cn: 将资源标识符视为远程文件系统路径名并将表示视为此类文件内容的副本很有诱惑力。

source: It is the client's job to send a ClientHello at that time.
zh_cn: 当时发送 ClientHello 是客户端的工作。

source: It is the implementation of a trade-off between memory and messages to provide information for this checking.
zh_cn: 它是在为此检查提供信息的内存和消息之间进行权衡的实现。

source: It is the main type to interact with other reactive libraries through a standardized mechanism governed by the [Reactive Streams specification](https://github.com/reactive-streams/reactive-streams-jvm#specification).
zh_cn: 它是通过由 [Reactive Streams 规范 ](https://github.com/reactive-streams/reactive-streams-jvm#specification) 管理的标准化机制与其他响应库交互的主要类型。

source: It is then the `observeOn`'s responsibility to call the `request` method in the right time and with the right value to keep the data flowing but not overflowing.
zh_cn: 然后，`observeOn` 有责任在正确的时间调用 `request` 方法并使用正确的值来保持数据流动但不会溢出。

source: It is unknown whether the reset problem is exclusive to TCP or might also be found in other transport connection protocols.
zh_cn: 不知道重置问题是否是 TCP 独有的，或者也可能在其他传输连接协议中找到。

source: It is used to provide separation between signatures made in different contexts, helping against potential cross-protocol attacks.
zh_cn: 它用于在不同的上下文中提供签名之间的分离，帮助抵御潜在的跨协议攻击。

source: It knows that repeating the request will have the same intended effect, even if the original request succeeded, though the response might differ.
zh_cn: 它知道重复请求将具有相同的预期效果，即使原始请求成功，尽管响应可能不同。

source: It may be useful in conjunction with the source operator `interval()`.
zh_cn: 它可能与源操作符 `interval()` 结合使用。

source: It may be useful to log the real cause of failure for troubleshooting purposes; however, care must be taken to avoid leaking the information to an attacker (through, e.g., timing, log files, or other channels.)
zh_cn: 记录故障的真正原因以进行故障排除可能很有用；但是，必须注意避免将信息泄露给攻击者(例如，通过时间，日志文件或其他渠道)。

source: It obsoletes [RFC2732], which introduced syntax for an IPv6 address.
zh_cn: 它废弃了 [RFC2732]，它引入了 IPv6 地址的语法。

source: It represents the consensus of the IETF community.
zh_cn: 它代表了 IETF 社区的共识。

source: It requires 2 x 32 byte keys and 2 x 32 byte MAC keys, for a total 128 bytes of key material.
zh_cn: 它需要 2 x 32 字节密钥和 2 x 32 字节 MAC 密钥，总共 128 字节的密钥材料。

source: It should be included in the exact form it is given without a length byte or trailing null character.
zh_cn: 它应该包含在给定的格式中，不带长度字节或尾随的空字符。

source: It should initiate a connection to the server on the appropriate port and then send the TLS ClientHello to begin the TLS handshake.
zh_cn: 它应该在适当的端口上启动与服务器的连接，然后发送 TLS ClientHello 以开始 TLS 握手。

source: It specifies a compression algorithm, an encryption algorithm, and a MAC algorithm.
zh_cn: 它指定了压缩算法，加密算法和 MAC 算法。

source: It takes two parameters:
zh_cn: 它需要两个参数：

source: It then responds with its own ServerHello (Section 4.1.3), which indicates the negotiated connection parameters.
zh_cn: 然后它使用自己的 ServerHello 响应(第 4.1.3 节)，它指示协商的连接参数。

source: It thus defines the syntax and semantics needed to implement a scheme-independent parsing mechanism for URI references, by which the scheme-dependent handling of a URI can be postponed until the scheme-dependent semantics are needed.
zh_cn: 因此，它定义了为 URI 引用实现与方案无关的解析机制所需的语法和语义，通过该机制可以推迟 URI 的依赖于方案的处理，直到需要依赖于方案的语义。

source: It was already designed along the Reactive-Streams style for 1.x so no user-level changes there.
zh_cn: 它已经按照 Reactive-Streams 样式设计了 1.x，因此没有用户级别的更改。

source: It was frequently misused and didn't implement the `Scheduler` specification correctly anyway; it contained blocking sleep for delayed action and didn't support recursive scheduling at all.
zh_cn: 它经常被滥用，并且无论如何都没有正确实现 `Scheduler` 规范；它包含阻塞睡眠以延迟操作，并且根本不支持递归调度。

source: It will also emit this same final value to any subsequent observers.
zh_cn: 它还将向任何后续观察者发射相同的最终值。

source: It will not make further calls to onNext or onCompleted.
zh_cn: 它不会进一步调用 onNext 或 onCompleted。

source: Items in named_group_list are ordered according to the sender's preferences (most preferred choice first).
zh_cn: named_group_list 中的项目根据发送者的首选项排序(最首选的选择)。

source: Its architecture now derives from the Reactive-Streams design.
zh_cn: 它的架构现在来自 Reactive-Streams 设计。

source: Its consumer type (`rx.Single.SingleSubscriber<T>`) has been changed from being a class that accepts `rx.Subscription` resources to be an interface `io.reactivex.SingleObserver<T>` that has only 3 methods:
zh_cn: 它的消费者类型(`rx.Single.SingleSubscriber<T>`)变化了，从接受 `rx.Subscription` 资源的类，变为只有 3 个方法的接口 `io.reactivex.SingleObserver<T>`：

source: Its encoding will include a two-byte actual length field prepended to the vector.
zh_cn: 它的编码将包括一个前置于 vector 的两字节实际长度字段。

source: Its functionality can be achieved via `TestScheduler`, `PublishProcessor`/`PublishSubject` and `observeOn(testScheduler)`/scheduler parameter.
zh_cn: 它的功能可以通过 `TestScheduler`，`PublishProcessor`/`PublishSubject` 和 `observeOn(testScheduler)`/scheduler 参数来实现。

source: Its usefulness is rather limited as there is no other information provided about the overflow than the current call stack.
zh_cn: 它的实用性相当有限，因为除了当前调用堆栈之外，没有其他关于溢出的信息。

source: Java doesn't consider signatures such as `operator(Function<T, Single<R>>)` and `operator(Function<T, Maybe<R>>)` different (unlike C#) and due to erasure, the two `operator`s would end up as duplicate methods with the same signature.
zh_cn: 由于擦除，Java 不认为 `operator(Function <T，Single <R >>)` 和 `operator(Function <T，Maybe <R >>)` 的签名是不同的(与 C# 不同)，这两个 ` operator` 最终会成为具有相同签名的重复方法。

source: Key Calculation
zh_cn: 密钥计算

source: Key Exchange Messages
zh_cn: 密钥交换消息

source: Keys are derived from two input secrets using the HKDF-Extract and Derive-Secret functions.
zh_cn: 密钥使用 HKDF-Extract 和 Derive-Secret 函数从两个输入机密派生。

source: Keywords "MUST", "MUST NOT", "REQUIRED", "SHOULD", "SHOULD NOT" and "MAY" that appear in this document are to be interpreted as described in [RFC2119].
zh_cn: 本文档中出现的关键词 "MUST", "MUST NOT", "REQUIRED", "SHOULD", "SHOULD NOT" 和 "MAY" 应按照 [RFC2119] 中的描述进行解释。

source: Knowing When to Keep Quiet
zh_cn: 知道什么时候保持安静

source: LAST-ACK - represents waiting for an acknowledgment of the connection termination request previously sent to the remote TCP (which includes an acknowledgment of its connection termination request).
zh_cn: LAST-ACK - 表示等待先前发送到远程 TCP 的连接终止请求的确认(其包括对其连接终止请求的确认)。

source: LF = <US-ASCII LF, linefeed (10)>
zh_cn: LF = <US-ASCII LF, 换行 (10)>

source: LISTEN - represents waiting for a connection request from any remote TCP and port.
zh_cn: LISTEN - 表示等待来自任何远程 TCP 和端口的连接请求。

source: LOALPHA = <any US-ASCII lowercase letter "a".."z">
zh_cn: LOALPHA = <任何 US-ASCII 小写字母 "a".."z">

source: Language Tags
zh_cn: 语言标签

source: Language-Specific Information:
zh_cn: 语言特定信息：

source: Last-Modified Dates
zh_cn: 最后修改日期

source: Leading bytes of Z that contain all zero bits are stripped before it is used as the pre_master_secret.
zh_cn: 在用作 pre_master_secret 之前，Z 包含全零位的前导字节被剥离。

source: Leading zeros MUST be ignored by recipients and MUST NOT be sent.
zh_cn: 收件人必须忽略前导零，且不得发送前导零。

source: Learn more about RxJava in general on the <a href="https://github.com/ReactiveX/RxJava/wiki">Wiki Home</a>.
zh_cn: 有关 RxJava 的更多信息可参阅 <a href="https://github.com/ReactiveX/RxJava/wiki">Wiki Home</a>.

source: Legacy algorithms: Indicates algorithms which are being deprecated because they use algorithms with known weaknesses, specifically SHA-1 which is used in this context with either (1) RSA using RSASSA-PKCS1-v1_5 or (2) ECDSA.
zh_cn: 旧版算法：表示由于使用具有已知弱点的算法而被弃用的算法，特别是 SHA-1，在此上下文中使用(1)使用 RSASSA-PKCS1-v1_5 的 RSA 或(2)ECDSA。

source: Legal values range from zero to 255, inclusive.
zh_cn: 合法值的范围从 0 到 255(包括 0 和 255)。

source: Length octets
zh_cn: 长度八位字节

source: Lengths longer than necessary might be desirable to frustrate attacks on a protocol that are based on analysis of the lengths of exchanged messages.
zh_cn: 可能需要长于所需的长度来阻止对基于对交换消息的长度的分析的协议的攻击。

source: Like Observables, Singles can be manipulated by means of a variety of operators.
zh_cn: 像 Observables 一样，Singles 可以通过各种操作符进行操作。

source: Like other messages, alert messages are encrypted and compressed, as specified by the current connection state.
zh_cn: 与其他消息一样，警报消息按当前连接状态的指定进行加密和压缩。

source: Like other messages, alert messages are encrypted as specified by the current connection state.
zh_cn: 与其他消息一样，警报消息按当前连接状态的指定进行加密。

source: Like the definition of safe, the idempotent property only applies to what has been requested by the user; a server is free to log each request separately, retain a revision control history, or implement other non-idempotent side effects for each idempotent request.
zh_cn: 与安全的定义一样，幂等属性仅适用于用户请求的内容；服务器可以单独记录每个请求，保留修订控制历史记录，或为每个幂等请求实现其他非幂等副作用。

source: Likewise, a client MUST read the entire response message body if it intends to reuse the same connection for a subsequent request.
zh_cn: 同样，如果客户端打算为后续请求重用相同的连接，则它必须读取整个响应消息体。

source: Likewise, a safe request initiated by selecting an advertisement on the Web will often have the side effect of charging an advertising account.
zh_cn: 同样，通过在 Web 上选择广告而发起的安全请求通常具有向广告账户收费的副作用。

source: Likewise, a user agent designed specifically to operate on a version control repository might be able to recover from partial failure conditions by checking the target resource revision(s) after a failed connection, reverting or fixing any changes that were partially applied, and then automatically retrying the requests that failed.
zh_cn: 同样，专门设计用于版本控制存储库的用户代理可能能够通过在连接失败后检查目标资源修订，恢复或修复部分应用的任何更改，然后自动从部分失败条件中恢复重试失败的请求。

source: Likewise, abstract concepts can be resources, such as the operators and operands of a mathematical equation, the types of a relationship (e.g., "parent" or "employee"), or numeric values (e.g., zero, one, and infinity).
zh_cn: 同样，抽象概念可以是资源，例如数学方程的操作符和操作数，关系的类型(例如，“父”或“雇员”)，或数值(例如，零，一和无穷大)。
